benchmarks/ec2/all_on/get_case.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 13.233.118.69 (be patient).....done


Server Software:        nginx/1.24.0
Server Hostname:        13.233.118.69
Server Port:            80

Document Path:          /api/cases/UPHC020665842025
Document Length:        1833 bytes

Concurrency Level:      1
Time taken for tests:   15.792 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      222800 bytes
HTML transferred:       183300 bytes
Requests per second:    6.33 [#/sec] (mean)
Time per request:       157.918 [ms] (mean)
Time per request:       157.918 [ms] (mean, across all concurrent requests)
Transfer rate:          13.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       49   70   8.1     70     109
Processing:    72   87  10.5     85     138
Waiting:       72   87  10.5     85     138
Total:        127  158  14.7    157     211

Percentage of the requests served within a certain time (ms)
  50%    157
  66%    161
  75%    164
  80%    168
  90%    173
  95%    182
  98%    210
  99%    211
 100%    211 (longest request)


| Metric          |                  Value |
| --------------- | ---------------------: |
| Endpoint        | `GET /api/cases/{cnr}` |
| Environment     |        EC2 (Public IP) |
| Redis           |                     ON |
| Kafka           |                     ON |
| Circuit Breaker |                     ON |
| Outbox          |                     ON |
| Requests        |                    100 |
| Concurrency     |                      1 |
| Mean latency    |          **157.92 ms** |
| Median (P50)    |             **157 ms** |
| P90             |             **173 ms** |
| P95             |             **182 ms** |
| P99             |             **211 ms** |
| Max             |             **211 ms** |
| Throughput      |         **6.33 req/s** |
| Errors          |                  **0** |