benchmarks/ec2/all_on/get_cases.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 13.233.118.69 (be patient).....done


Server Software:        nginx/1.24.0
Server Hostname:        13.233.118.69
Server Port:            80

Document Path:          /api/cases
Document Length:        1835 bytes

Concurrency Level:      1
Time taken for tests:   15.841 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      223000 bytes
HTML transferred:       183500 bytes
Requests per second:    6.31 [#/sec] (mean)
Time per request:       158.407 [ms] (mean)
Time per request:       158.407 [ms] (mean, across all concurrent requests)
Transfer rate:          13.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       52   71   6.9     71      92
Processing:    74   88   7.1     87     105
Waiting:       70   87   7.3     87     105
Total:        130  158   9.7    158     186

Percentage of the requests served within a certain time (ms)
  50%    158
  66%    162
  75%    166
  80%    167
  90%    170
  95%    173
  98%    184
  99%    186
 100%    186 (longest request)


| Metric          |            Value |
| --------------- | ---------------: |
| Endpoint        | `GET /api/cases` |
| Environment     |  EC2 (Public IP) |
| Redis           |               ON |
| Kafka           |               ON |
| Circuit Breaker |               ON |
| Outbox          |               ON |
| Requests        |              100 |
| Concurrency     |                1 |
| Mean latency    |    **158.41 ms** |
| Median (P50)    |       **158 ms** |
| P90             |       **170 ms** |
| P95             |       **173 ms** |
| P99             |       **186 ms** |
| Max             |       **186 ms** |
| Throughput      |   **6.31 req/s** |
| Errors          |            **0** |